from time import sleep
from random import randint


def student_call(students):
    if students:
        print('К доске пойдет...')
        sleep(1)
        print(' ... пойдет к доске...')
        sleep(1.2)
        to_call = students.pop(randint(0, len(students) - 1))
        print(to_call)
    else:
        print('Не кого вызвать к доске')

"""
Задачки

1. Створити список із n випадкових цілих чисел з діапазону (1, М).
   n та М отримати з клавіатури запитом користувача (input).
   
2. Зробити программу, яка отримує строку від користувача та перевертає її навпаки
    "qwrety" --> "ytrewq"
    "asdfgh" --> "hgfdsa"
Зробити так щоб программа працювала, поки користувач не набере "stop".

3. Зробити программу, яка створює випадковий пароль довжиною із n символів.
    Пароль створюється із цифр, великих і малих літер, знаків пунктуації.
    
4. Надається деяка строка. Потрбіно порахувати скільки в ній голосних літер.

5. Надається деякий великий список. Необхідно розділити його на 3 (або 5, 7 ...) 
    "корзини" максимально рівномірно, не підряд.
    Приблизно таким чином:
    [1,2,3,4,5,6,7,8,9,10] ---> 
    [
        [1,4,7,10],
        [2,5,8]
        [3,6,9]
    ]
    
6. Дано два різних списки. Необхідно повернути тільки ті елементи що присутні в обох списках

7. Користувач вводить деяке число. Потрібно перевірити чи є число паліндромом
    12321 -- True
    4554 -- True
    23445 -- False
    
8. Сгенерувати "колоду" із 36 карт: 9 номіналів 4х мастей. Повернути "колоду" у випадковому порядку

9*. Повернути список чисел Фібоначчі менших ніж N
    N=10 --> [1,2,3,5,8]
    N=20 --> [1,2,3,5,8,13]
    N=56 --> [1,2,3,5,8,13,21,34,55]

10*. Є слот машина на барабані якої 5 картинок, серед яких є Джокер. 
    Наприклад ['cherry', 'lemon', 'watermelon', '7', 'JOKER'].
    Треба зробити так , щоб джокер випадав приблизно в два рази рідше ніж всі решта.
    
11. Користувач вводить деякий IP адрес. Треба зʼясувати чи є строка корректною IP адресою.
    172.17.0.1  -- True
    ryfrygf     -- False
    275.0.0.1   -- False
    
12.  Користувач вводить назву або номер місяця. Треба повернути який це сезон - літо, зима осінь чи весна.
    7           - літо
    жовтень     - осінь
    January     - зима
    
13**. Перевести римське число в арабське
    III         -- 3
    XXI         -- 21
    DIV         -- 54
    CCХС        -- 290
    MMXIX       -- 2019
    
"""
